===============================================================================
Description (Empty)
===============================================================================

%description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)))

===============================================================================
Description (One-Line)
===============================================================================

%description
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (text
      (text_content))))

===============================================================================
Description (subpackage)
===============================================================================

%description subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macros)
===============================================================================

%description subpackage
The %{name}-subpackage package

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content)
      (macro_expansion
        (identifier))
      (text_content))))

===============================================================================
Description (subpackage with arbitrary name)
===============================================================================

%description -n subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macro-including name)
===============================================================================

%description -n %{name}-foo
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (macro_expansion
        (identifier)))
    (text
      (text_content))))

===============================================================================
Description (subpackage with inline text)
===============================================================================

%description -n %{crate} %{_description}

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (macro_expansion
        (identifier)))
    (text
      (macro_expansion
        (identifier)))))
