===============================================================================
Description (Empty)
===============================================================================

%description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)))

===============================================================================
Description (One-Line)
===============================================================================

%description
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (text
      (text_content))))

===============================================================================
Description (subpackage)
===============================================================================

%description subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macros)
===============================================================================

%description subpackage
The %{name}-subpackage package

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content)
      (macro_expansion
        (identifier))
      (text_content))))

===============================================================================
Description (subpackage with arbitrary name)
===============================================================================

%description -n subpackage
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content))))

===============================================================================
Description (subpackage with macro-including name)
===============================================================================

%description -n %{name}-foo
Simple description

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (macro_expansion
        (identifier)))
    (text
      (text_content))))

===============================================================================
Description (subpackage with inline text)
===============================================================================

%description -n %{crate} %{_description}

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (macro_expansion
        (identifier)))
    (text
      (macro_expansion
        (identifier)))))

===============================================================================
Description (with conditional and shell macro)
===============================================================================

%description
Main description text.
%if 0%{?stable}
Built from %(c=%version; echo "v${c%.*}-stable") branch.
%endif

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (text
      (text_content))
    condition: (concatenation
      (integer)
      (macro_expansion
        (conditional_expansion
          condition: (identifier))))
    consequence: (text
      (text_content)
      (macro_shell_expansion
        (shell_command
          (script_code)
          (macro_simple_expansion
            (simple_macro))
          (script_code)))
      (text_content))))

===============================================================================
Description (followed by conditional with package)
===============================================================================

%description dcerpc
DCE RPC binaries description.

%if %{with dc}
%package dc
Summary: Domain Controller

%description dc
DC description.
%endif

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content)))
  (if_statement
    condition: (with_operator
      (identifier))
    consequence: (package
      (section_name)
      (subpackage_name
        (word))
      (preamble
        (tags
          (tag)
          value: (concatenation
            (word)
            (word)))))
    consequence: (description
      (section_name)
      (subpackage_name
        (word))
      (text
        (text_content)))))

===============================================================================
Description (conditional with multiple packages)
===============================================================================

%description main
Main description.

%if %{with feature}
%package feature
Summary: Feature package

%description feature
Feature description.

%package feature-devel
Summary: Feature development files

%description feature-devel
Devel description.
%endif

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content)))
  (if_statement
    condition: (with_operator
      (identifier))
    consequence: (package
      (section_name)
      (subpackage_name
        (word))
      (preamble
        (tags
          (tag)
          value: (concatenation
            (word)
            (word)))))
    consequence: (description
      (section_name)
      (subpackage_name
        (word))
      (text
        (text_content)))
    consequence: (package
      (section_name)
      (subpackage_name
        (word))
      (preamble
        (tags
          (tag)
          value: (concatenation
            (word)
            (word)
            (word)))))
    consequence: (description
      (section_name)
      (subpackage_name
        (word))
      (text
        (text_content)))))

===============================================================================
Description (with quoted strings)
===============================================================================

%description devel
This package contains library source intended for building other packages which
use the "%{crate}" crate.

-------------------------------------------------------------------------------

(spec
  (description
    (section_name)
    (subpackage_name
      (word))
    (text
      (text_content)
      (text_content)
      (quoted_string
        (macro_expansion
          (identifier)))
      (text_content))))