===============================================================================
Macros (%define)
===============================================================================

%define foo bar

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (word)))

===============================================================================
Macros (%global)
===============================================================================

%global foo bar

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (word)))

===============================================================================
Macros (%global positive integer)
===============================================================================

%global foo 1

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (integer)))

===============================================================================
Macros (%global negative integer)
===============================================================================

%global foo -1

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (integer)))

===============================================================================
Macros (%global hex)
===============================================================================

%global foo 0x20

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (integer)))

===============================================================================
Macros (%global function with empty arguments)
===============================================================================

%global foo() bar

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    (parametric_options)
    value: (word)))

===============================================================================
Macros (%global function with line continuation)
===============================================================================

%global myfunc() \
    echo test

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    (parametric_options)
    value: (line_continuation)
    value: (word)
    value: (word)))

===============================================================================
Macros (%global function with value and line continuation)
===============================================================================

%global myfunc() x \
echo test

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    (parametric_options)
    value: (word)
    value: (line_continuation)
    value: (word)
    value: (word)))

===============================================================================
Macros (%global multi-line function definition)
===============================================================================

%global systemd_post() \
if [ $1 -eq 1 ]; then \
    systemctl daemon-reload \
fi \
%{nil}

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    (parametric_options)
    value: (line_continuation)
    value: (word)
    value: (word)
    value: (word)
    value: (word)
    value: (integer)
    value: (word)
    value: (word)
    value: (line_continuation)
    value: (word)
    value: (word)
    value: (line_continuation)
    value: (word)
    value: (line_continuation)
    value: (macro_expansion
      (special_variable_name))))

===============================================================================
Macros (%global with quoted string)
===============================================================================

%global foo "bar"

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    (identifier)
    (quoted_string
      (quoted_string_content))))

===============================================================================
Macros (%undefine)
===============================================================================

%undefine foo

-------------------------------------------------------------------------------

(spec
  (macro_undefinition
    (builtin)
    (identifier)))

===============================================================================
Macros (Usage/Braces)
===============================================================================

%{getncpus}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)))


===============================================================================
Macros (Conditional macro defintion #1)
===============================================================================

%{!?_make_verbose:%define _make_verbose V=1 VERBOSE=1}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      (negation_operator)
      (identifier)
      (macro_definition
        (builtin)
        (identifier)
        (word)
        (word)))))

===============================================================================
Macros (Conditional macro definition #2)
===============================================================================

%{!?gopath: %global gopath %{_datadir}/gocode}

# Comment

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      (negation_operator)
      (identifier)
      (macro_definition
        (builtin)
        (identifier)
        (macro_expansion
          (identifier))
        (word))))
  (comment))

===============================================================================
Macros (Complex arguments with quotes)
===============================================================================

%prep
%setup -q -n "package name with spaces"
%patch0 -p1 -b "file.bak"

-------------------------------------------------------------------------------
(spec
  (prep_scriptlet
    (section_name)
    (script_block
      (setup_macro
        (builtin)
        (macro_option)
        (macro_option
          (quoted_string
            (quoted_string_content))))
      (patch_macro
        (patch_legacy_token
          (builtin))
        (macro_option)
        (macro_option
          (quoted_string
            (quoted_string_content)))))))

===============================================================================
Macros (Nested macro arguments)
===============================================================================

%{expand: %{configure %{configure_args}}}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (expand_content
      (expand_code)
      (macro_expansion
        (identifier)
        argument: (macro_expansion
          (identifier))))))

===============================================================================
Macros (Function-style Built-in with Colon)
===============================================================================

%{basename:/path/to/file.txt}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (path)))

===============================================================================
Macros (Environment Variable Expansion)
===============================================================================

%{getenv:HOME}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (expand_content
      (expand_code))))

===============================================================================
Macros (String Transformation Functions)
===============================================================================

%{upper:hello world}
%{lower:HELLO WORLD}
%{shrink:  extra   spaces  }

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (expand_content
      (expand_code)))
  (macro_expansion
    (builtin)
    argument: (expand_content
      (expand_code)))
  (macro_expansion
    (builtin)
    argument: (expand_content
      (expand_code))))

===============================================================================
Macros (Path Operations)
===============================================================================

%{dirname:/usr/local/bin/program}
%{basename:/usr/local/bin/program}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (path))
  (macro_expansion
    (builtin)
    argument: (path)))

===============================================================================
Macros (Nested Function Calls)
===============================================================================

%{upper:%{basename:/path/to/FILE.txt}}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (expand_content
      (macro_expansion
        (builtin)
        argument: (path)))))

===============================================================================
Macros (Complex Lua with Variables)
:skip
===============================================================================

%{lua:
local name = rpm.expand("%{name}")
print("Package: " .. name)
}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    (text
      (text_content)
      (macro_expansion
        (identifier))
      (text_content))))

===============================================================================
Macros (%global with parenthesized string value)
===============================================================================

%global elf_bits (64bit)

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (macro_value_text)))

===============================================================================
Macros (%global with parentheses and macro expansion)
===============================================================================

%global elf_suffix ()%{elf_bits}

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (macro_value_text)
    value: (macro_expansion
      (identifier))))

===============================================================================
Macros (%global with angle brackets)
===============================================================================

%global email_addr <user@example.com>

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (macro_value_text)))

===============================================================================
Macros (%global with pipe and semicolon)
===============================================================================

%global filter_cmd cat | grep foo; echo done

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (word)
    value: (macro_value_text)
    value: (word)
    value: (word)
    value: (word)
    value: (word)))

===============================================================================
Macros (Conditional expansion with text consequence)
===============================================================================

%{?version_override:1.2.3}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      condition: (identifier)
      consequence: (text
        (text_content)))))

===============================================================================
Macros (Negated conditional expansion with text consequence)
===============================================================================

%{!?version_override:258.3}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      operator: (negation_operator)
      condition: (identifier)
      consequence: (text
        (text_content)))))

===============================================================================
Macros (Conditional expansion with shell command consequence)
===============================================================================

%{!?version_override:%(cat meson.version)}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      operator: (negation_operator)
      condition: (identifier)
      consequence: (text
        (macro_shell_expansion
          (shell_command
            (script_code)))))))

===============================================================================
Macros (Conditional expansion concatenated with default)
===============================================================================

%{?version_override}%{!?version_override:258.3}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (conditional_expansion
      condition: (identifier)))
  (macro_expansion
    (conditional_expansion
      operator: (negation_operator)
      condition: (identifier)
      consequence: (text
        (text_content)))))

===============================================================================
Macros (Conditional expansion in Version tag)
===============================================================================

Version: %{?version_override}%{!?version_override:258.3}

-------------------------------------------------------------------------------

(spec
  (preamble
    (tags
      (tag)
      value: (concatenation
        (macro_expansion
          (conditional_expansion
            condition: (identifier)))
        (macro_expansion
          (conditional_expansion
            operator: (negation_operator)
            condition: (identifier)
            consequence: (text
              (text_content))))))))

===============================================================================
Macros (Escape sequence in macro value - regex pattern)
===============================================================================

%global __requires_exclude ^golang\\(.*\\)$

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (word)
    value: (escape_sequence)
    value: (macro_value_text)
    value: (escape_sequence)
    value: (macro_value_text)))

===============================================================================
Macros (Triple backslash - escaped backslash with line continuation)
===============================================================================

%global godocs docs README.md\\\
               more/files.txt

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (builtin)
    name: (identifier)
    value: (word)
    value: (word)
    value: (escape_sequence)
    value: (line_continuation)
    value: (word)))
