===============================================================================
Simple Macro Expansion (Built-in macro without braces)
===============================================================================

%getncpus

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)))

===============================================================================
Simple Macro Expansion (Custom macro with single argument)
===============================================================================

# Expansion
%bcond_without foo

# Just some comment

-------------------------------------------------------------------------------

(spec
  (comment)
  (macro_simple_expansion_parametric
    (identifier)
    argument: (word))
  (comment))

===============================================================================
Simple Macro Expansion (Custom macro with multiple arguments)
===============================================================================

# Expansion
%bcond foo 1

# Just some comment

-------------------------------------------------------------------------------

(spec
  (comment)
  (macro_simple_expansion_parametric
    (identifier)
    argument: (word)
    argument: (integer))
  (comment))

===============================================================================
Simple Macro Expansion (Built-in macro dirname)
===============================================================================

%dirname

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)))

===============================================================================
Simple Macro Expansion (Built-in macro upper)
===============================================================================

%upper

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)))

===============================================================================
Simple Macro Expansion (Built-in macro lower)
===============================================================================

%lower

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)))

===============================================================================
Simple Macro Expansion (Built-in macro getenv)
===============================================================================

%getenv

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)))

===============================================================================
Simple Macro Expansion (Builtin macro SOURCE0)
===============================================================================

%build
cp %SOURCE0 .

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_name)
    (shell_block
      (string
        (string_content))
      (macro_simple_expansion_parametric
        (builtin
          (macro_source))
        argument: (word)))))

===============================================================================
Simple Macro Expansion (Custom macro name in tag)
===============================================================================

Name: %pkg_name

-------------------------------------------------------------------------------

(spec
  (preamble
    (tags
      (tag)
      (macro_simple_expansion
        (identifier)))))

===============================================================================
Simple Macro Expansion (Concatenation)
===============================================================================

Source: %name-%version.tar.gz

-------------------------------------------------------------------------------

(spec
  (preamble
    (tags
      (tag)
      (concatenation
        (macro_simple_expansion
          (identifier))
        (word)
        (macro_simple_expansion
          (identifier))
        (word)))))

===============================================================================
Simple Macro Expansion (Custom macro with numbers)
===============================================================================

%configure

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (identifier)))

===============================================================================
Simple Macro Expansion (Special variable all arguments)
===============================================================================

%*

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_variable_name)))

===============================================================================
Simple Macro Expansion (Special variable quoted arguments)
===============================================================================

%**

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_variable_name)))

===============================================================================
Simple Macro Expansion (Special variable argument count)
===============================================================================

%#

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_variable_name)))

===============================================================================
Simple Macro Expansion (Special variable positional argument)
===============================================================================

%1

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_variable_name)))

===============================================================================
Simple Macro Expansion (Special variable nil)
===============================================================================

%nil

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_variable_name)))

===============================================================================
Simple Macro Expansion (Negation operator with built-in)
===============================================================================

%!exists %{builddir}/myflag.txt

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (builtin)
    argument: (macro_expansion
      (identifier))
    argument: (word)))

===============================================================================
Simple Macro Expansion (Negation operator with custom macro)
===============================================================================

%!debug

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion_parametric
    (identifier)))
