===============================================================================
Simple Macro Expansion (Source colon syntax S:0)
===============================================================================

%build
cp %{S:0} .

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_name)
    (shell_block
      (shell_content)
      (macro_expansion
        (macro_source)
        argument: (integer))
      (shell_content))))

===============================================================================
Simple Macro Expansion (Patch colon syntax P:1)
===============================================================================

%build
%{P:1}

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_name)
    (shell_block
      (macro_expansion
        (macro_patch)
        argument: (integer)))))

===============================================================================
Simple Macro Expansion (Source colon syntax with larger index)
===============================================================================

%build
cp %{S:123} .

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_name)
    (shell_block
      (shell_content)
      (macro_expansion
        (macro_source)
        argument: (integer))
      (shell_content))))

===============================================================================
Simple Macro Expansion (Custom macro name in tag)
===============================================================================

Name: %pkg_name

-------------------------------------------------------------------------------

(spec
  (preamble
    (tags
      (tag)
      (macro_simple_expansion
        (simple_macro)))))

===============================================================================
Simple Macro Expansion (Concatenation)
===============================================================================

Source: %name-%version.tar.gz

-------------------------------------------------------------------------------

(spec
  (preamble
    (tags
      (tag)
      (concatenation
        (macro_simple_expansion
          (simple_macro))
        (word)
        (macro_simple_expansion
          (simple_macro))
        (word)))))

===============================================================================
Simple Macro Expansion (Special variable all arguments)
===============================================================================

%*

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable quoted arguments)
===============================================================================

%**

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable argument count)
===============================================================================

%#

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable positional argument)
===============================================================================

%1

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable nil)
===============================================================================

%nil

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))
