===============================================================================
Changelog (Empty)
===============================================================================

%changelog

-------------------------------------------------------------------------------

(spec
  (changelog))

===============================================================================
Changelog (without Version)
===============================================================================

%changelog
* Fri Jun 21 2002 Alice <alice@alice.com>
- automated rebuild

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content)))))

===============================================================================
Changelog (Version)
===============================================================================

%changelog
* Tue May 08 2001 Alice Alice <alice@alice.com> 1.3-1
- updated to 1.3

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content)))))

===============================================================================
Changelog (Multi-line)
===============================================================================

%changelog
* Fri May 32 9999 Alice Alice <alice@alice.com> 1.3-1
- Updated to 1.3
- Fixed a bug

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content))
      (string
        (string_content)))))

===============================================================================
Changelog (with continuation line)
===============================================================================

%changelog
* Fri Dec 18 2020 Alice <alice@alice.com> - 1.0-1
- Split out subpackage
  https://bugzilla.example.com/show_bug.cgi?id=123

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content))
      (string
        (string_content)))))

===============================================================================
Changelog (with escape sequence in text)
===============================================================================

%changelog
* Wed Apr 01 2015 John Doe <john@example.com> 1.0-1
- ignore variables with embedded '=' or '\0' characters

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content)))))

===============================================================================
Changelog (item without leading dash)
===============================================================================

%changelog
* Wed Jun 04 2003 Jane Doe <jane@example.com>
6 rebuilt

-------------------------------------------------------------------------------

(spec
  (changelog
    (changelog_entry
      (string_content)
      (string
        (string_content)))))
