===============================================================================
Macro Expression (simple arithmetic)
===============================================================================

%define result %[3 + 4]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (integer)
        (integer)))))

===============================================================================
Macro Expression (arithmetic with precedence)
===============================================================================

%define result %[3 + 4 * 2]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (integer)
        (binary_expression
          (integer)
          (integer))))))

===============================================================================
Macro Expression (comparison)
===============================================================================

%define check %[1 < 2]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (integer)
        (integer)))))

===============================================================================
Macro Expression (ternary with comparison)
===============================================================================

%define check %[1 < 2 ? "yes" : "no"]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (ternary_operator
        (binary_expression
          (integer)
          (integer))
        (quoted_string
          (string_content))
        (quoted_string
          (string_content))))))

===============================================================================
Macro Expression (version literal comparison)
===============================================================================

%define cmp %[v"2.0" > v"1.0"]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (version_literal
          (string_content))
        (version_literal
          (string_content))))))

===============================================================================
Macro Expression (version literal with epoch)
===============================================================================

%define cmp %[v"1:2.0" > v"3.0"]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (version_literal
          (string_content))
        (version_literal
          (string_content))))))

===============================================================================
Macro Expression (with macro expansion)
===============================================================================

%define result %[%{value} + 1]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (binary_expression
        (macro_expansion
          (identifier))
        (integer)))))

===============================================================================
Macro Expression (ternary with macro in condition)
===============================================================================

%define check %[%{flag} ? "enabled" : "disabled"]

-------------------------------------------------------------------------------

(spec
  (macro_definition
    (identifier)
    (macro_expression
      (ternary_operator
        (macro_expansion
          (identifier))
        (quoted_string
          (string_content))
        (quoted_string
          (string_content))))))

===============================================================================
Macro Expression (expr builtin simple)
===============================================================================

%{expr:5+3}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (binary_expression
      left: (integer)
      right: (integer))))

===============================================================================
Macro Expression (expr builtin multiplication)
===============================================================================

%{expr:5*1024}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (binary_expression
      left: (integer)
      right: (integer))))

===============================================================================
Macro Expression (expr builtin precedence)
===============================================================================

%{expr:1+2*3}

-------------------------------------------------------------------------------

(spec
  (macro_expansion
    (builtin)
    argument: (binary_expression
      left: (integer)
      right: (binary_expression
        left: (integer)
        right: (integer)))))

===============================================================================
Macro Expression (ternary with concatenation)
===============================================================================

%[0%{?have_bpf}?"enabled":"disabled"]

-------------------------------------------------------------------------------

(spec
  (macro_expression
    (ternary_operator
      condition: (macro_expression_concatenation
        (integer)
        (macro_expansion
          (conditional_expansion
            condition: (identifier))))
      consequence: (quoted_string
        (string_content))
      alternative: (quoted_string
        (string_content)))))
