===============================================================================
Simple Macro Expansion (Source colon syntax S:0)
===============================================================================

%build
cp %{S:0} .

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (script_content)
        (macro_expansion
          (macro_source)
          argument: (integer))
        (script_content)))))

===============================================================================
Simple Macro Expansion (Patch colon syntax P:1)
===============================================================================

%build
%{P:1}

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (macro_expansion
          (macro_patch)
          argument: (integer))))))

===============================================================================
Simple Macro Expansion (Source colon syntax with larger index)
===============================================================================

%build
cp %{S:123} .

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (script_content)
        (macro_expansion
          (macro_source)
          argument: (integer))
        (script_content)))))

===============================================================================
Simple Macro Expansion (Custom macro name in tag)
===============================================================================

Name: %pkg_name

-------------------------------------------------------------------------------

(spec
  (preamble
    (tag)
    (macro_simple_expansion
      (simple_macro))))

===============================================================================
Simple Macro Expansion (Special variable all arguments)
===============================================================================

%*

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable quoted arguments)
===============================================================================

%**

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable argument count)
===============================================================================

%#

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable positional argument)
===============================================================================

%1

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (Special variable nil)
===============================================================================

%nil

-------------------------------------------------------------------------------

(spec
  (macro_simple_expansion
    (special_macro)))

===============================================================================
Simple Macro Expansion (in shell block followed by section)
===============================================================================

%install
%make_install

%files
/usr/bin/foo

-------------------------------------------------------------------------------

(spec
  (install_scriptlet
    (section_install)
    (script_block
      (script_line
        (macro_simple_expansion
          (simple_macro)))))
  (files
    (file
      (path))))

===============================================================================
Simple Macro Expansion (in shell block with content before and after)
===============================================================================

%install
echo test
%make_install
find %{buildroot} -name foo

%files -n lib%{name}
%license LICENSE

-------------------------------------------------------------------------------

(spec
  (install_scriptlet
    (section_install)
    (script_block
      (script_line
        (script_content))
      (script_line
        (macro_simple_expansion
          (simple_macro)))
      (script_line
        (script_content)
        (macro_expansion
          (identifier))
        (script_content))))
  (files
    (identifier)
    (macro_expansion
      (identifier))
    (file
      (file_qualifier)
      (path))))
