===============================================================================
Parametric Macro Expansion (bcond with arguments)
===============================================================================

%bcond bzip2 1

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    argument: (word)
    argument: (integer)))

===============================================================================
Parametric Macro Expansion (bcond with expression)
===============================================================================

%bcond docs %[%{?__isa_bits} >= 64]

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    argument: (word)
    argument: (macro_expression
      (binary_expression
        left: (macro_expansion
          (conditional_expansion
            condition: (identifier)))
        right: (integer)))))

===============================================================================
Parametric Macro Expansion (configure with line continuation)
===============================================================================

%configure \
  --prefix=/usr \
  --libsuffix=64

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    (line_continuation)
    argument: (word)
    (line_continuation)
    argument: (word)))

===============================================================================
Parametric Macro Expansion (bcond inside ifarch)
===============================================================================

%bcond_without luajit

%ifarch x86_64
  %bcond_without test
%endif

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    argument: (word))
  (ifarch_statement
    condition: (arch
      (identifier))
    consequence: (macro_parametric_expansion
      name: (identifier)
      argument: (word))))

===============================================================================
Simple Macro Expansion (configure with line continuation in script_block)
===============================================================================

%build
%configure \
  --prefix=/usr \
  --libsuffix=64

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (macro_simple_expansion
          (simple_macro))
        (line_continuation)
        (script_content)
        (line_continuation)
        (script_content)))))

===============================================================================
Simple Macro Expansion (with embedded conditional in line continuation)
===============================================================================

%build
%configure \
  --prefix=/usr \
%if %{with unittests}
  --enable-unittests \
%endif
  --with-systemd

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (macro_simple_expansion
          (simple_macro))
        (line_continuation)
        (script_content)
        (line_continuation)
        (if_statement
          condition: (with_operator
            (identifier))
          consequence: (script_line
            (script_content)))
        (script_content)))))

===============================================================================
Parametric Macro Expansion (with short options)
===============================================================================

%mymacro -p -n value arg1

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    option: (macro_option)
    option: (macro_option)
    argument: (word)
    argument: (word)))

===============================================================================
Parametric Macro Expansion (with macro arguments)
===============================================================================

%mymacro %{name} %{version}

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    argument: (macro_expansion
      (identifier))
    argument: (macro_expansion
      (identifier))))

===============================================================================
Parametric Macro Expansion (with option terminator)
===============================================================================

%mymacro -p -- arg1 arg2

-------------------------------------------------------------------------------

(spec
  (macro_parametric_expansion
    name: (identifier)
    option: (macro_option)
    (macro_option_terminator)
    argument: (word)
    argument: (word)))

===============================================================================
Parametric Macro Expansion (with option terminator and pass-through)
===============================================================================

%check
%{cargo_test -- -- --skip test_foo}

-------------------------------------------------------------------------------

(spec
  (check_scriptlet
    (section_check)
    (script_block
      (script_line
        (macro_expansion
          (identifier)
          (macro_option_terminator)
          argument: (word)
          argument: (word)
          argument: (word))))))

===============================================================================
Parametric Macro Expansion (macro inside shell subcommand is simple)
===============================================================================

%build
KCFLAGS="-fno-pie -fdebug-prefix-map=$(%python3 -c '%find_vmlinux_h')"

-------------------------------------------------------------------------------

(spec
  (build_scriptlet
    (section_build)
    (script_block
      (script_line
        (script_content)
        (macro_simple_expansion
          (simple_macro))
        (script_content)
        (macro_simple_expansion
          (simple_macro))
        (script_content)))))
