===============================================================================
Sourcelist (Empty)
===============================================================================

%sourcelist

-------------------------------------------------------------------------------

(spec
  (sourcelist))

===============================================================================
Sourcelist (Single URL)
===============================================================================

%sourcelist
https://example.com/foo-1.0.tar.gz

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (url)))

===============================================================================
Sourcelist (Multiple URLs)
===============================================================================

%sourcelist
https://example.com/foo-1.0.tar.gz
https://example.com/foo-data-1.0.zip

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (url)
    (url)))

===============================================================================
Sourcelist (URL with macros)
===============================================================================

%sourcelist
https://example.com/%{name}-%{version}.tar.gz

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (url
      (macro_expansion
        (identifier))
      (macro_expansion
        (identifier)))))

===============================================================================
Sourcelist (Local file path)
===============================================================================

%sourcelist
foo-1.0.tar.gz

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (file)))

===============================================================================
Sourcelist (Mixed URLs and files)
===============================================================================

%sourcelist
https://example.com/foo-1.0.tar.gz
local-patch.tar.gz
ftp://ftp.example.org/data.zip

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (url)
    (file)
    (url)))

===============================================================================
Sourcelist (with %if conditional)
===============================================================================

%sourcelist
https://example.com/foo-1.0.tar.gz
%if 0%{?fedora}
https://example.com/fedora-extra.tar.gz
%endif
https://example.com/common.tar.gz

-------------------------------------------------------------------------------

(spec
  (sourcelist
    (url)
    condition: (concatenation
      (integer)
      (macro_expansion
        (conditional_expansion
          condition: (identifier))))
    consequence: (url)
    (url)))
